
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АктивностьСертификата
	Движения.АктивностьСертификата.Записывать = Истина;
	Движение = Движения.АктивностьСертификата.Добавить();
	Движение.Период = Дата;
	Движение.Сертификат = Сертификат;
	Движение.Активен = ЛОЖЬ;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
